tutorials/fluidFoam/cylinderInChannel/Allrun
#!/bin/sh

# Source tutorial clean functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication fluentMeshToFoam cylinderInChannel.msh
runApplication changeDictionary
runApplication fluidFoam