tutorials/fluidFoam/cylinderInChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
Outlet
{
    type            patch;
    nFaces          40;
    startFace       10722;
}

Inlet
{
    type            patch;
    nFaces          40;
    startFace       10762;
}

CylinderWall
{
    type            wall;
    nFaces          100;
    startFace       10802;
}

BottomWall
{
    type            wall;
    nFaces          110;
    startFace       10902;
}

TopWall
{
    type            wall;
    nFaces          110;
    startFace       11012;
}

frontAndBackPlanes
{
    type            empty;
    nFaces          10922;
    startFace       11122;
}

)


// ************************************************************************* //
